["```py\nText: i'll bet the video game is a lot more fun than the film.\nSentiment: \n```", "```py\nText: (lawrence bounces) all over the stage, dancing, running, sweating, mopping his face and generally displaying the wacky talent that brought him fame in the first place.\nSentiment: positive\n\nText: despite all evidence to the contrary, this clunker has somehow managed to pose as an actual feature movie, the kind that charges full admission and gets hyped on tv and purports to amuse small children and ostensible adults.\nSentiment: negative\n\nText: for the first time in years, de niro digs deep emotionally, perhaps because he's been stirred by the powerful work of his co-stars.\nSentiment: positive\n\nText: i'll bet the video game is a lot more fun than the film.\nSentiment: \n```", "```py\nPlease label the sentiment towards the movie of the given movie review. The sentiment label should be \"positive\" or \"negative\". \nText: i'll bet the video game is a lot more fun than the film. \nSentiment: \n```", "```py\nDescribe what is quantum physics to a 6-year-old. \n```", "```py\n... in language that is safe for work. \n```", "```py\nDefinition: Determine the speaker of the dialogue, \"agent\" or \"customer\".\nInput: I have successfully booked your tickets.\nOuput: agent\n\nDefinition: Determine which category the question asks for, \"Quantity\" or \"Location\".\nInput: What's the oldest building in US?\nOuput: Location\n\nDefinition: Classify the sentiment of the given movie review, \"positive\" or \"negative\".\nInput: i'll bet the video game is a lot more fun than the film.\nOutput: \n```", "```py\nQuestion: Tom and Elizabeth have a competition to climb a hill. Elizabeth takes 30 minutes to climb the hill. Tom takes four times as long as Elizabeth does to climb the hill. How many hours does it take Tom to climb up the hill?\nAnswer: It takes Tom 30*4 = <<30*4=120>>120 minutes to climb the hill.\nIt takes Tom 120/60 = <<120/60=2>>2 hours to climb the hill.\nSo the answer is 2.\n===\nQuestion: Jack is a soccer player. He needs to buy two pairs of socks and a pair of soccer shoes. Each pair of socks cost $9.50, and the shoes cost $92\\. Jack has $40\\. How much more money does Jack need?\nAnswer: The total cost of two pairs of socks is $9.50 x 2 = $<<9.5*2=19>>19.\nThe total cost of the socks and the shoes is $19 + $92 = $<<19+92=111>>111.\nJack need $111 - $40 = $<<111-40=71>>71 more.\nSo the answer is 71.\n===\nQuestion: Marty has 100 centimeters of ribbon that he must cut into 4 equal parts. Each of the cut parts must be divided into 5 equal parts. How long will each final cut be?\nAnswer: \n```", "```py\nQuestion: Marty has 100 centimeters of ribbon that he must cut into 4 equal parts. Each of the cut parts must be divided into 5 equal parts. How long will each final cut be?\nAnswer: Let's think step by step. \n```", "```py\nEvidence: ...\nQuestion: ...\nAnswer: ... \n```", "```py\nGenerate some knowledge about the input. Examples:\n\nInput: What type of water formation is formed by clouds?\nKnowledge: Clouds are made of water vapor.\n\nInput: {question}\nKnowledge: \n```", "```py\n@article{weng2023prompt,\n  title   = \"Prompt Engineering\",\n  author  = \"Weng, Lilian\",\n  journal = \"lilianweng.github.io\",\n  year    = \"2023\",\n  month   = \"Mar\",\n  url     = \"https://lilianweng.github.io/posts/2023-03-15-prompt-engineering/\"\n} \n```"]